#!/bin/bash
#날짜와 시간
# date -d yesterday '+%A, %B %d,%Y'
-d 문자열, --date=문자열 현재 시간은 아니며, 문자열에 의해 명시된 날짜를 보여줌
-f 파일, --file=파일 -d 옵션과 동일하며, 단 파일에서 날짜를 읽어와 보여줌
-I[타임스팩], --iso-8601[=타임스팩] ISO 8601 형식으로 날짜와 시간을 보여줌. 타임스팩으로 hours,

minutes, date, seconds, ns를 사용할 수 있음

-r 파일, --reference=파일 파일의 최근 수정일자를 보여줌
-R, --rfc-2822 RFC 2822 포맷으로 날짜와 시간을 보여줌
예) Mon, 07 Aug 2006 12:34:56 -0600

--rfc-3339=타임스팩 RFC 3339 포맷으로 날짜와 시간을 보여줌. 타임스팩으로 date,

seconds, ns를 사용할 수 있음
-s 문자열, --set=문자열 문자열에 의해 명시한 시간으로 설정
-u, --utc, --universal UTC 타입으로 설정하고 출력함
--help Date 사용법과 옵션을 보여줌
--version Date 버전을 보여줌


#format
%% % 기호 %N 나노초(000000000..999999999)
%a 로케일 타입의 짧은 요일(예: Sun) %p 로케일 타입의 AM 또는 PM
%A 로케일 타입의 요일(예: Sunday) %P %p와 동일하며, 소문자임
%b 로케일 타입의 짧은 월(예: Jan) %r 로케일 타입의 시(예: 11:11:04 PM)
%B 로케일 타입의 월(예: January) %R 24시간 기준의 시와 분, %H:%M와 동일
%c 로케일에 따른 날짜와 시간 %s UTC 타입의 초
(예: Thu Mar 3 23:05:25 2005) %S 초 (00..60)
%C 세기(예: 20) %t 탭
%d 일(예: 01) %T 시간(%H:%M:%S)
%D 날짜 %m/%d/%y) %u 요일 (1..7); 1은 월요일임
%e 일 %_d와 동일함 %U 일요일로 시작하는 연도의 주수(00..53)
%F 날짜(%Y-%m-%d) %V 월요일로 시작하는 연도의 주수(01..53)
%g 2 자릿수 연도 %w 주별 일수 (0..6); 0은 일요일임
%G 4 자리수 연도 %W 월요일로 시작하는 연도별 주수(00..53)
%h %b 와 동일함 %x 로케일 타입의 날짜(예: 12/31/99)
%H 시 (00..23) %X 로케일 타입의 시간(예: 23:13:48)
%I 시 (01..12) %y 연도(00..99)
%j 일 (001..366) %Y 연도
%k 시 ( 0..23), %_H와 동일함 %z 타임존(예: +0900)
%l 시 ( 1..12), %_I 와 동일함 %:z 타임존(예: +09:00)
%m 월(01..12) %::z 타임존(예: +09:00:00)
%M 분(00..59) %:::z 타임존(예: +09, +05:30)
%n 뉴라인 %Z 타임존(예: KST)
