#!/bin/bash
#찾은문자열바꾸기
# sed [옵션] '어드레스 {명령어}' 대상 파일
#sed 's/Today/YesterDay/' ./resource/temp.txt > ./resource/temp_replace.txt

#-f 별도의 파일로 옵션 뺴놓고 사용 가능

#-e
#cat /etc/ssh/sshd_config | sed -e 's/#PermitRoot/PermitRoot/' | grep '^PermitRoot'

#어드레스
number 명시된 숫자에 해당하는 라인 번호일 경우 다음 명령어를 수행함
number~step 명시된 숫자에 해당하는 라인부터 명시한 단계만큼 해당 라인을 스킵한 다음 라인일 경우

다음 명령어를 수행함

$ 파일의 마지막 라인일 경우 다음 명령어를 수행함
/regexp/ 명시한 정규 표현식과 일치하는 라인일 경우 다음 명령어를 수행함
\cregexpc 명시한 정규 표현식과 일치하는 라인일 경우 다음 명령어를 수행함
0,addr2 1번째 라인부터 addr2가 포함된 라인까지가 범위이며, addr2는 정규 표현식이여야 함
addr1,+N addr1이 포함된 라인부터 +N라인까지가 범위이며, addr1은 정규 표현식이여야 하며, N

은 숫자여야 함

addr1,~N addr1이 포함된 라인을 기준으로 N라인까지가 범위이며, addr1은 정규 표현식이여야

하며, N은 숫자여야 함

#명령어
number 명시된 숫자에 해당하는 라인 번호일 경우 다음 명령어를 수행함
number~step 명시된 숫자에 해당하는 라인부터 명시한 단계만큼 해당 라인을 스킵한 다음 라인일 경우

다음 명령어를 수행함

$ 파일의 마지막 라인일 경우 다음 명령어를 수행함
/regexp/ 명시한 정규 표현식과 일치하는 라인일 경우 다음 명령어를 수행함
\cregexpc 명시한 정규 표현식과 일치하는 라인일 경우 다음 명령어를 수행함
0,addr2 1번째 라인부터 addr2가 포함된 라인까지가 범위이며, addr2는 정규 표현식이여야 함
addr1,+N addr1이 포함된 라인부터 +N라인까지가 범위이며, addr1은 정규 표현식이여야 하며, N

은 숫자여야 함

addr1,~N addr1이 포함된 라인을 기준으로 N라인까지가 범위이며, addr1은 정규 표현식이여야

하며, N은 숫자여야 함

#어드레스 범위 명령어
b label 라벨을 호출함
c \ text 앞에서 명시된 패턴이 포함된 라인을 text 문자열로 변경
d D 앞에서 명시된 패턴 삭제
h H 패턴 공간을 홀드 공간에 복사/추가
g G 홀드 공간을 패턴 공간에 복사/추가
l 입력된 데이터의 현재 라인 출력
l width 명시한 너비에 맞게 입력된 데이터의 현재 라인 출력
n N 입력된 데이터의 다음 라인을 복사/추가
p P 현재 패턴 공간 출력
s/regexp/replacement/ 정규 표현식(regexp)에 해당하는 데이터를 그 다음 오는 데이터(replacement)

로 변경함

t label / T label 앞에서 선언된 명령어를 실행 후 라벨로 분기
w 파일명 / W 파일명 명시한 파일에 현재 패턴 공간을 저장함
x 홀드와 패턴 공간의 콘텐츠를 교환함
y/source/dest/ 패턴이 포함된 라인의 문자열(source)을 dest 문자열로 변경


#옵션
-n, --quiet, --silent 현재 패턴 공간을 출력하지 않음
-e 스크립트, --expression=스크립트 여러 개의 스크립트를 실행할 때 사용함
-f 스크립트파일, --file=스크립트파일 스크립트파일을 통해 sed를 실행할 때 사용함
--follow-symlinks -i 옵션과 함께 사용할 경우 스크립트 실행 결과를 심볼릭 링크 자체가

아닌 심볼릭 링크와 연결된 원본 파일에 적용함

-i파일 확장자, --in-place=파일 확장자 스크립트 실행 결과를 파일에 바로 적용함. 이때, 파일 확장자를 명시하

면, 변경 전 명시한 확장자를 가진 백업 파일을 생성함

-c, --copy -i 옵션과 함께 사용할 수 있으며, 파일명 뒤에 c가 붙은 백업 파일을 생

성함

-l N, --line-length=N l 명령어와 함께 사용할 수 있으며, 긴 문자열을 포함하는 파일의 내용을
확인할 경우 명시한 N만큼 라인 넓이를 설정할 수 있음
--posix POSIX 확장 기능을 끔. POSIX 확장을 지원하지 않는 시스템에서
sed를 실행해야 할 경우 POSIX 확장 기능을 끄고, 스크립트를 검증할
수 있음
-r, --regexp-extended 스크립트에서 POSIX 확장 정규식을 사용할 수 있음. Sed는 기본적으

로 확장 정규식을 인식하지 않음

-s, --separate Sed는 기본적으로 여러 개의 파일을 하나의 파일로 간주하지만, -s 옵

션을 사용하면 여러 개의 파일을 각각 처리할 수 있음

-u, --unbuffered 대용량의 파일에서 스크립트 실행 결과를 터미널로 출력할 경우, -u 옵

션을 사용하면 버퍼를 자주 비워 성능이 향상됨
-z, --null-data 구분 기호가 null인 데이터의 문자열을 변경할 때 사용
--help Sed 사용법 및 도움말을 보여줌
--version 버전 정보를 보여줌
